x1,y1=input('Enter coordinates of the first point ' )
x2,y2=input('Enter coordinates of the second point ' )
x3,y3=input('Enter coordinates of the third point ' )
x1=float(x1)
x2=float(x2)
x3=float(x3)
y1=float(y1)
y2=float(y2)
y3=float(y3)
#расчет длин стороны треугольника
a=((y2-y1)**2+(x2-x1)**2)**0.5
b=((y3-y1)**2+(x3-x1)**2)**0.5
c=((y3-y2)**2+(x3-x2)**2)**0.5
#print ('a=', a, 'b=', b, 'c=', c) #вывод длин сторон треугольника
p=(a+b+c)/2 #расчет p
#print ('p=', p)
S=(p*(p-a)*(p-b)*(p-c))**0.5
Square = (((((y2-y1)**2+(x2-x1)**2)**0.5)+(((y3-y1)**2+(x3-x1)**2)**0.5)+(((y3-y2)**2+(x3-x2)**2)**0.5))/2)*(((((y2-y1)**2+(x2-x1)**2)**0.5)+(((y3-y1)**2+(x3-x1)**2)**0.5)+(((y3-y2)**2+(x3-x2)**2)**0.5))/2)-(((y2-y1)**2+(x2-x1)**2)**0.5)*(((((y2-y1)**2+(x2-x1)**2)**0.5)+(((y3-y1)**2+(x3-x1)**2)**0.5)+(((y3-y2)**2+(x3-x2)**2)**0.5))/2)-(((y3-y1)**2+(x3-x1)**2)**0.5)*((((y2-y1)**2+(x2-x1)**2)**0.5+(((y3-y1)**2+(x3-x1)**2)**0.5)+(((y3-y2)**2+(x3-x2)**2)**0.5)/2)-(((y3-y2)**2+(x3-x2)**2)**0.5))**0.5
print ('Square=', Square)
print ('S=', S)


